# Analytical Distribution Node Property Data Class

Source: https://www.revitapidocs.com/2026/08a43b98-428c-2bd4-d1c3-fc425563d67e.htm

---

| Analytical Distribution Node Property Data Class |
| --- |

Represents the data and parameters of electrical analytical node. Inheritance Hierarchy System Object
Autodesk.Revit.DB.Electrical AnalyticalDistributionNodePropertyData
Autodesk.Revit.DB.Electrical AnalyticalEquipmentLoadData
Autodesk.Revit.DB.Electrical AnalyticalPowerDistributableNodeData

**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class AnalyticalDistributionNodePropertyData : IDisposable
```

```
Public Class AnalyticalDistributionNodePropertyData
	Implements IDisposable
```

```
public ref class AnalyticalDistributionNodePropertyData : IDisposable
```

```
type AnalyticalDistributionNodePropertyData =
    class
        interface IDisposable
    end
```
The AnalyticalDistributionNodePropertyData type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | ConnectedPhases | The electrical connected phases of the electrical analytical node to its upstream node. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the AnalyticalDistributionNodePropertyData |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

Autodesk.Revit.DB.Electrical Namespace